In [2]:
import pandas as pd

In [3]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
index_s = ['a', 'b', 'c', 'd', 'e']
ser = pd.Series([1,2,3,4,5], index=index_s)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
ser[0], ser['a']

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_38564\1772165095.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0], ser['a']

(np.int64(1), np.int64(1))

In [13]:
dict_data = {'a':1, 'b':2, 'c':3, 'd':4}
s = pd.Series(dict_data)
print(s)

a    1
b    2
c    3
d    4
dtype: int64

In [15]:
ser2 = pd.Series([10, 'banana'])
print(ser2)
print(type(ser2))

0        10
1    banana
dtype: object
<class 'pandas.core.series.Series'>

In [ ]:
population = pd.Series([9776, 2729, 1566, 3158], 
                    index=['ÏÑúÏö∏', 'Î∂ÄÏÇ∞', 'Ïù∏Ï≤ú', 'ÎåÄÍµ¨'])
print(population['Î∂ÄÏÇ∞'])
print(population[['ÏÑúÏö∏', 'Î∂ÄÏÇ∞']]) #0,1 index ÏßÄÏ†ïÌï¥ÏÑú Î∂ÄÎ•¥Îäî Î∞©Ïãù: Ìå¨ÏãúÏù∏Îç±Ïã±

2729
ÏÑúÏö∏    9776
Î∂ÄÏÇ∞    2729
dtype: int64

In [19]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, ÏÑúÏö∏ to ÎåÄÍµ¨
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [23]:
#ser[0], ser['a']
ser.iloc[0], ser.loc['a']

(np.int64(1), np.int64(1))

# 1. Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùò ÏÉùÏÑ±
- pd.DataFrame(data, index=[ÌñâÏù¥Î¶ÑÎì§], columns=[Ïó¥Ïù¥Î¶ÑÎì§])

In [28]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [26]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [59]:
scientists.index

Index(['Rosaline Franklin', 'William Gosset'], dtype='object')

## 1-1. iloc[] ÏôÄ loc[] Ï∞®Ïù¥Ï†êüëÄ
- iloc[] : indexlocator  ‚û°Ô∏è Ïà´Ïûê Ïù∏Îç±Ïä§Î°ú ÌñâÏù¥ÎÇò Ïó¥ÏùÑ ÏÑ†ÌÉùÌï† Îïå ÏÇ¨Ïö© 
- loc[] : locator ‚û°Ô∏è ÎùºÎ≤® Í∏∞Î∞ò Ïù∏Îç±Ïã±Ïù¥Í∏∞ ÎïåÎ¨∏Ïóê Î¨∏ÏûêÏó¥ Ïù∏Îç±Ïä§Í∞Ä Í∞ÄÎä•

In [25]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

In [27]:
scientists['Name']

0    Rosaline Franklin
1       William Gosset
Name: Name, dtype: object

In [29]:
scientists.index = ['Rosaline Franklin', 'William Gosset']

In [30]:
scientists

,Name,Occupation,Born,Died,Age
Rosaline Franklin,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37
William Gosset,William Gosset,Statistician,1876-06-13,1937-10-16,61

In [31]:
scientists.loc['William Gosset']

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [34]:
scientists.iloc[1]

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

## 1-2. Î¶¨Ïä§Ìä∏Î°ú Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ ÏÉùÏÑ±ÌïòÍ∏∞
- 2Ï∞®Ïõê Î¶¨Ïä§Ìä∏Î•º ÏÇ¨Ïö©ÌïòÎ©∞, Í∞Å ÎÇ¥Î∂Ä Î¶¨Ïä§Ìä∏Îäî ÌïòÎÇòÏùò ÌñâÏùÑ ÎÇòÌÉÄÎÇ∏Îã§.

In [35]:
#Î¶¨Ïä§Ìä∏Î°ú Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ ÏÉùÏÑ±
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

df = pd.DataFrame(data)
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [57]:
df = pd.DataFrame(data, index=['0Ô∏è‚É£', '1Ô∏è‚É£', '2Ô∏è‚É£'])
print(df)

     0  1  2
0Ô∏è‚É£  1  2  3
1Ô∏è‚É£  4  5  6
2Ô∏è‚É£  7  8  9

In [58]:
#Ïó¥ Ïù¥Î¶Ñ ÏßÄÏ†ïÌïòÏó¨ ÏÉùÏÑ±
df = pd.DataFrame(data, index=['a', 'b', 'c'],columns=['A', 'B', 'C'])
print(df)

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [60]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

In [62]:
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [61]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [64]:
sci1.loc[0,'Name']

'Rosaline Franklin'

In [66]:
sci1.loc[0, 'Occupation']

'Chemist'

In [68]:
sci1.to_csv('./data/sci1.csv')

In [69]:
sci1.to_csv('./data/scientists_2.csv', index=False)

In [70]:
df = pd.read_csv('./data/scientists_2.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [74]:
df1 = pd.read_csv('./data/scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

# Îç∞Ïù¥ÌÑ∞ ÎØ∏Î¶¨Î≥¥Í∏∞
**1. .info()** : Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùò Í∏∞Î≥∏ Ï†ïÎ≥¥   
 - (Ìñâ/Ïó¥ Í∞úÏàò, Îç∞Ïù¥ÌÑ∞ ÌÉÄÏûÖ, Î©îÎ™®Î¶¨ ÏÇ¨Ïö©Îüâ Îì±)Î•º ÌëúÏãú   
**2. .head()** : Ï≤òÏùå ~5Î≤àÏß∏ index Î≥¥Ïó¨Ï§å   
**3. .tail()** : ÎÅùÏóêÏÑú 5Î≤àÏß∏~ ÎÅù ÏùÑ Î≥¥Ïó¨Ï§å
**4. .descrive()** : ÏàòÏπòÌòï Ïó¥Ïóê ÎåÄÌïú ÏöîÏïΩ ÌÜµÍ≥ÑÎüâ (ÌèâÍ∑†, ÌëúÏ§ÄÌé∏Ï∞®, ÏµúÏÜå/ÏµúÎåÄÍ∞í Îì±)ÏùÑ Í≥ÑÏÇ∞

In [81]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [79]:
df1.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [80]:
df1.tail()

            Name        Born        Died  Age          Occupation
3    Marie Curie  1867-11-07  1934-07-04   66             Chemist
4  Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5      John Snow  1813-03-15  1858-06-16   45           Physician
6    Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7   Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [89]:
df1['Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

# pickle: ÌååÏù¥Ïç¨ Í∞ùÏ≤¥ÌòïÏùÑ Ï†ÄÏû•
sci1.to_pickle('/data/scientists.pickle')

In [77]:
sci1.to_pickle('./data/scientist.pickle')

In [78]:
df2 = pd.read_pickle('./data/scientist.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [ ]:
sci1.to_pickle('/data/scientists.pickle.csv')

In [ ]:
sci1.to_csv(''/data/scientist_2.pickle.csv')

In [96]:
print('index :', df1.index)
print('columns : ', df1.columns)

index : RangeIndex(start=0, stop=8, step=1)
columns :  Index(['Name', 'Born', 'Died', 'Age', 'Occupation'], dtype='object')

In [99]:
df1.shape

(8, 5)

In [105]:
df1.values

array([['Rosaline Franklin', '1920-07-25', '1958-04-16', 37, 'Chemist'],
       ['William Gosset', '1876-06-13', '1937-10-16', 61, 'Statistician'],
       ['Florence Nightingale', '1820-05-12', '1910-08-13', 90, 'Nurse'],
       ['Marie Curie', '1867-11-07', '1934-07-04', 66, 'Chemist'],
       ['Rachel Carson', '1907-05-27', '1964-04-14', 56, 'Biologist'],
       ['John Snow', '1813-03-15', '1858-06-16', 45, 'Physician'],
       ['Alan Turing', '1912-06-23', '1954-06-07', 41,
        'Computer Scientist'],
       ['Johann Gauss', '1777-04-30', '1855-02-23', 77, 'Mathematician']],
      dtype=object)

In [ ]:
# # 'ÌòÑÏû¨ Ïó¥ Ïù¥Î¶Ñ' Í≥º 'Î∞îÍæ∏Î†§Îäî Ïó¥ Ïù¥Î¶Ñ' Í∞úÏàòÍ∞Ä "ÎèôÏùº"Ìï¥ÏïºÌï®

df1.columns = ['name', 'born', 'died', 'age', 'occupation']
print(df1.columns)
print(len(df1.columns))
print(len(['name', 'born', 'died', 'age', 'occupation']))

Index(['name', 'born', 'died', 'age', 'occupation'], dtype='object')
5
5

In [114]:
df = pd.read_csv('./data/gapminder.tsv' , sep='\t')